reversing/challenge10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenge 10</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Challenge 10</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#original-assembly">1. Original assembly</a></li>
<li><a href="#assembly-notes">2. Assembly notes</a></li>
<li><a href="#c-translation">3. C translation</a></li>
<li><a href="#missing-subtraction">4. Missing subtraction</a></li>
<li><a href="#why-does-the-alignment-work">5. Why does the alignment work?</a></li>
</ul>
</div>
</div>

<div id="outline-container-original-assembly" class="outline-2">
<h2 id="original-assembly"><span class="section-number-2">1.</span> Original assembly</h2>
<div class="outline-text-2" id="text-original-assembly">
<p>
Original challenge link: <a href="https://challenges.re/10/">Click me</a>.
</p>

<p>
As the author says, this snippet is short but tricky.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">func</span>:
    <span style="color: #feacd0;">lea</span>     <span style="color: #6ae4b9;">eax</span>, [<span style="color: #6ae4b9;">rdi</span> - <span style="color: #88ca9f;">1</span> + <span style="color: #6ae4b9;">rsi</span>]
    <span style="color: #feacd0;">neg</span>     <span style="color: #6ae4b9;">esi</span>
    <span style="color: #feacd0;">and</span>     <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">esi</span>
    <span style="color: #feacd0;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-assembly-notes" class="outline-2">
<h2 id="assembly-notes"><span class="section-number-2">2.</span> Assembly notes</h2>
<div class="outline-text-2" id="text-assembly-notes">
<p>
Remember that the <code>lea</code> instruction (<a href="https://www.felixcloutier.com/x86/lea">Load Effective Address</a>) is often used by
compilers for basic arithmetic. That <code>lea</code> instruction is equivalent to the
following.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #989898;">; </span><span style="color: #989898;">eax = rdi - 1 + rsi</span>
<span style="color: #feacd0;">mov</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">edi</span>
<span style="color: #feacd0;">sub</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">1</span>
<span style="color: #feacd0;">add</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">esi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-c-translation" class="outline-2">
<h2 id="c-translation"><span class="section-number-2">3.</span> C translation</h2>
<div class="outline-text-2" id="text-c-translation">
<p>
I had trouble figuring out this challenge because I was <b>focusing on
understanding the assembly</b>, before trying to translate it to C. By looking at
those individual instructions, it's hard to see the relationship between
them. However, if I had looked at the C code, I might have been able to figure
out what it does.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">func</span>(<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">a</span>, <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">b</span>) {
    <span style="color: #ff6f9f;">return</span> (a - <span style="color: #88ca9f;">1</span> + b) &amp; (-b);
}
</pre>
</div>

<p>
This might look a bit more familiar. I used similar code in my <a href="https://github.com/8dcc/libdetour/blob/f333a583ef74d37f6e1e764e3fc56fc8cd1e6198/src/libdetour.c#L45-L46">libdetour</a> hooking
library for calculating the address of the page where an address is located, and
then passing that to <code>mprotect()</code>. I had to ask <a href="https://yurichev.com/">Dennis Yurichev</a>, the author of the
challenges, and I felt a bit ashamed because I tried to understand the assembly
directly before translating it into C code.
</p>

<p>
The function aligns a number <i>n</i> to a <i>boundary</i>, as long as that boundary is a
power of 2. The original C code would be something like this:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #79a8ff;">int</span> <span style="color: #4ae2ff;">align2boundary</span>(<span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">n</span>, <span style="color: #79a8ff;">int</span> <span style="color: #6ae4b9;">boundary</span>) {
    <span style="color: #ff6f9f;">return</span> (n + boundary - <span style="color: #88ca9f;">1</span>) &amp; ~(boundary - <span style="color: #88ca9f;">1</span>);
}
</pre>
</div>

<p>
For example, if we have an address 0x123, and we want to know where the next
4KiB-page starts, we could use our <code>align2boundary</code> function as like this:
</p>

<div class="org-src-container">
<pre class="src src-C">align2boundary(<span style="color: #88ca9f;">0x0123</span>, <span style="color: #88ca9f;">0x1000</span>); <span style="color: #989898;">/* </span><span style="color: #989898;">Result: 0x1000</span><span style="color: #989898;"> */</span>
align2boundary(<span style="color: #88ca9f;">0x2345</span>, <span style="color: #88ca9f;">0x1000</span>); <span style="color: #989898;">/* </span><span style="color: #989898;">Result: 0x3000</span><span style="color: #989898;"> */</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-missing-subtraction" class="outline-2">
<h2 id="missing-subtraction"><span class="section-number-2">4.</span> Missing subtraction</h2>
<div class="outline-text-2" id="text-missing-subtraction">
<p>
However, the C translation and the real C code is not quite the same. Where did
the <code>~(boundary - 1)</code> go? The compiler optimized this to a <code>neg</code> instruction because
subtracting one and then doing a bit-wise NOT is the same as negating the
number.
</p>

<pre class="example" id="orgba53b8c">
   -1   0b1111111111111111
   -2   0b1111111111111110
   -3   0b1111111111111101
   -4   0b1111111111111100
   -5   0b1111111111111011

    4   0b0000000000000100
  4-1   0b0000000000000011
~(4-1)  0b1111111111111100

    5   0b0000000000000101
  5-1   0b0000000000000100
~(5-1)  0b1111111111111011
</pre>

<p>
As you can see, <code>~(n-1)</code> and <code>(-n)</code> is the same.
</p>
</div>
</div>

<div id="outline-container-why-does-the-alignment-work" class="outline-2">
<h2 id="why-does-the-alignment-work"><span class="section-number-2">5.</span> Why does the alignment work?</h2>
<div class="outline-text-2" id="text-why-does-the-alignment-work">
<p>
Let's try to reduce an example first.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #989898;">/* </span><span style="color: #989898;">align2boundary(0x3456, 0x1000)</span><span style="color: #989898;"> */</span>
<span style="color: #88ca9f;">0x3456</span> + <span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
         <span style="color: #88ca9f;">0x4456</span> - <span style="color: #88ca9f;">1</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
             <span style="color: #88ca9f;">0x4455</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
             <span style="color: #88ca9f;">0x4455</span> &amp; ~(<span style="color: #88ca9f;">0x0FFF</span>)
             <span style="color: #88ca9f;">0x4455</span> &amp; <span style="color: #88ca9f;">0xFFFFF000</span>
             <span style="color: #88ca9f;">0x4000</span>
</pre>
</div>

<p>
You might be wondering, why do we need the subtractions? Each subtraction serves
a different purpose. Let's start with the right-most subtraction, the second
one. It ensures that we can use an input bigger than the boundary itself.
</p>

<p>
If you subtract one to any power of 2, you will set to 1 all the bytes to the
right of the one that was set previously. For example:
</p>

<pre class="example">
   0x8  0b0001000
   0x7  0b0000111

  0x10  0b10000
   0xF  0b01111

0x2000  0b10000000000000
0x1FFF  0b01111111111111
</pre>

<p>
What about the first subtraction? The left-most subtraction ensures we don't
allocate an extra "page" if we are already aligned to the boundary. For example,
in the following example, the input <code>0x4000</code> is already aligned to the <code>0x1000</code>
boundary, so we should return the untouched <code>0x4000</code>.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #88ca9f;">0x4000</span> + <span style="color: #88ca9f;">0x1000</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
         <span style="color: #88ca9f;">0x5000</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
         <span style="color: #88ca9f;">0x5000</span>
</pre>
</div>

<p>
However, if we subtract one:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #88ca9f;">0x4000</span> + <span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
         <span style="color: #88ca9f;">0x5000</span> - <span style="color: #88ca9f;">1</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
             <span style="color: #88ca9f;">0x4FFF</span> &amp; ~(<span style="color: #88ca9f;">0x1000</span> - <span style="color: #88ca9f;">1</span>)
             <span style="color: #88ca9f;">0x4000</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
